

errorDict = {
0:'内部错误报警',
1:'编码器 ABZ 连接报警' ,
2:'编码器 UVW 连接报警', 
3:'编码器计数报警' ,
4:'驱动器高温报警' ,
5:'驱动器高压报警' ,
6:'驱动器低压报警' ,
7:'驱动器过流报警' ,
8:'吸收电阻报警' ,
9:'位置误差过大报警' ,
10:'逻辑低压报警' ,
11:'电机或驱动器 iit 报警', 
12:'脉冲频率过高报警', 
13:'电机高温报警',
14:'电机励磁报警', 
15:'存储器报警'
}

motorDict = {
0:'电机断电',
1:'回原点' ,
2:'主限位触发', 
3:'副限位触发' }


deviceDict = {
0:'相机断开',
1:'手爪断开' ,
2:'编码器 UVW 连接报警', 
3:'编码器计数报警' }

armDict = {
0:'左下',
1:'右下' ,
2:'左上', 
3:'右上' }

motorID = {
0:'上方纵向',
1:'下方纵向' ,
2:'左上横向', 
3:'右上横向' ,
4:'右下横向' ,
5:'左下横向' ,
6:'左上伸缩' ,
7:'右上伸缩' ,
8:'右下伸缩' ,
9:'左下伸缩' ,      
}
